#### Load ipython-sql extension

In [1]:
# The 2 lines below prevent an error message from being displayed when we run %load_ext sql
import warnings
warnings.filterwarnings('ignore')

%load_ext sql
%config SqlMagic.feedback = False

#### Connect to the database

In [2]:
%%sql

postgresql://localhost/dvdrental

'Connected: None@dvdrental'

#### A simple example

In [3]:
%%sql

SELECT
    *
FROM
    customer_list cl
WHERE
    -- Note that equality tests use just one equals sign
    cl.country = 'Canada'

[(476, 'Derrick Bourque', '1153 Allende Way', '20336', '856872225376', 'Gatineau', 'Canada', 'active', 1),
 (463, 'Darrell Power', '1844 Usak Avenue', '84461', '164414772677', 'Halifax', 'Canada', 'active', 2),
 (189, 'Loretta Carpenter', '891 Novi Sad Manor', '5379', '247646995453', 'Oshawa', 'Canada', 'active', 1),
 (410, 'Curtis Irby', '432 Garden Grove Street', '65630', '615964523510', 'Richmond Hill', 'Canada', 'active', 2),
 (436, 'Troy Quigley', '983 Santa F Way', '47472', '145720452260', 'Vancouver', 'Canada', 'active', 1)]

#### Filter on multiple conditions with AND

In [4]:
%%sql

SELECT
    *
FROM
    customer_list cl
WHERE
    cl.country = 'Canada'
    AND cl.sid = 1

[(476, 'Derrick Bourque', '1153 Allende Way', '20336', '856872225376', 'Gatineau', 'Canada', 'active', 1),
 (189, 'Loretta Carpenter', '891 Novi Sad Manor', '5379', '247646995453', 'Oshawa', 'Canada', 'active', 1),
 (436, 'Troy Quigley', '983 Santa F Way', '47472', '145720452260', 'Vancouver', 'Canada', 'active', 1)]

#### The OR operator

In [5]:
%%sql

SELECT
    *
FROM
    customer_list cl
WHERE
    cl.country = 'Canada'
    OR cl.city = 'Graz'

[(476, 'Derrick Bourque', '1153 Allende Way', '20336', '856872225376', 'Gatineau', 'Canada', 'active', 1),
 (173, 'Audrey Ray', '1010 Klerksdorp Way', '6802', '493008546874', 'Graz', 'Austria', 'active', 1),
 (463, 'Darrell Power', '1844 Usak Avenue', '84461', '164414772677', 'Halifax', 'Canada', 'active', 2),
 (189, 'Loretta Carpenter', '891 Novi Sad Manor', '5379', '247646995453', 'Oshawa', 'Canada', 'active', 1),
 (410, 'Curtis Irby', '432 Garden Grove Street', '65630', '615964523510', 'Richmond Hill', 'Canada', 'active', 2),
 (436, 'Troy Quigley', '983 Santa F Way', '47472', '145720452260', 'Vancouver', 'Canada', 'active', 1)]

#### Combining operators
This query will return all details of people matching ONE of the following conditions:
- They live in London
- They are named Clive and don't live in Berlin

In [6]:
%%sql

SELECT
    *
FROM
    customer_list cl
WHERE
    cl.city = 'Kabul'
    OR (
        cl.name = 'Cecil Vines'
        AND cl.city = 'London'
    )

[(218, 'Vera Mccoy', '1168 Najafabad Parkway', '40301', '886649065861', 'Kabul', 'Afghanistan', 'active', 1),
 (512, 'Cecil Vines', '548 Uruapan Street', '35653', '879347453467', 'London', 'United Kingdom', 'active', 1)]